{"data":[["What foods can a teenager cook for his parents to help their depression?", "fuckingivf", ["Ok, so, I'm a parent and I struggle with depression and mental health problems, and honestly, I think even if i just knew my kid had asked this question and was trying to think about how to take care of me, it would mean the world to me.", "(Well, at the moment he's only 13 months old so I would also be pretty astonished, but you know what I mean.", ")  But I would *also* be a little bit worried, and I would want my kid to know that it's not their job to fix, or even help, my mental illness.", "And I'd want to make sure that they were okay, and not taking on too many responsibilities that they weren't really old enough to cope with.", "So, since you already have a bunch of good suggestions and recipes in this thread, I'm going to just suggest that you make sure you're looking after yourself as well as your parents, and that you ask for help if you need it.", "Good luck with everything.", "(Also, pasta.", "It's easy, it's good comfort food, most people like it, and you can vary the sauce/sides to include protein and veg."]], ["What foods can a teenager cook for his parents to help their depression?", "zerbey", ["Think of the favourite meal your Mother made for you and make them that.", "Tell her why it's so special.", "I'm really sorry you're going through this, my own Mum suffers from bouts of depression too and it's very hard :( I talk to her about special memories from my childhood and it seems to help."]], ["What foods can a teenager cook for his parents to help their depression?", "staringoutinwonder", ["Literally anything.", "Depression can be so draining that it's exhausting to do daily activities, like cooking dinner.", "Just simply supporting them in the way you are is bound to help.", "You sound like a great kid - I hope you're well and that your parents start feeling like themselves soon."]], ["What foods can a teenager cook for his parents to help their depression?", "Adams2799", []], ["What foods can a teenager cook for his parents to help their depression?", "AudibleNod", ["Something they consider comfort food.", "It's different for everyone, but start with the classics.", "Chicken pot pie for instance."]], ["What foods can a teenager cook for his parents to help their depression?", "alphabravotaco", ["Someone else can chime in on whether this pasta dish can help with depression, but here's my \"adulting\" recipe for three bowl pasta (three bowl because you will go back for seconds, and thirds; adulting because I made it up right after college).", "* 1 box of Pasta: go with a thicker pasta, like ziti or rigitoni, cook it to the boxes instructions, but save some of the water.", "Also, salt the fuck out of your water!", "People say it should be like sea water, but those people have no idea how much salt is in sea water (it's around 1 cup of salt per gallon of water for sea water).", "Don't go that hard, but way more than a pinch.", "* Onion soup mix.", "* Green pepper and red pepper.", "* Garlic.", "* Olive oil.", "* Parmesan Cheese.", "Here's the instructions: Start the pasta water.", "Chop up the peppers, cut them into long strips.", "Heat a pan to a bit past medium.", "When hot, pour in a tablespoon or so of olive oil, then the peppers.", "Stir them around occasionally to cook them.", "At some point your pasta water is boiling (and you have added a lot of salt!", ") and you can cook the pasta to the box instructions.", "Keep at the peppers, when they are less firm, throw in a clove of garlic (minced, I buy the pre-minced kind because I'm lazy).", "Whenever you're happy with the peppers, turn them off and remove from heat.", "When the pasta is done, get at least 2 cups of the water out, and then strain.", "In a big bowl, pour in about 1/4 cup of your pasta water and stir in  the onion soup mix (one packet).", "Then pour in the pasta and the peppers.", "This is going to be a thick sauce, probably too thick, so add more of the pasta water until you think it's right.", "When it's to your liking, plate it up, and allow your guests to add as much cheese as they like.", "It all takes about 20 minutes to make, and is really simple.", "You can add butter or whatever if you want it creamy.", "Throw in some green onions if you feel like.", "You can also use onion/mushroom soup mix.", "That's a bit different, but you do you.", "EDIT: I love mushrooms to the point where I have been told I shouldn't recommend them (hence the last line not really recommending them), but I would add a shitton of mushrooms to this about halfway through the pepper cook, sliced thin.", "If you want the mushrooms to be more earthy, slice them thicker, or bake them really thick, but that's making the dish more involved, and I don't think OP wanted that."]], ["What foods can a teenager cook for his parents to help their depression?", "o_shrub", ["This post breaks my heart.", "I wish I had an answer for you, but the truth is we can’t fix someone else’s depression at any age.", "Good on you for trying (that’s what humans do).", "But if it doesn’t work, don’t blame your chicken soup.", "Depression is a bear."]], ["What foods can a teenager cook for his parents to help their depression?", "bumblehoneyb", ["warm and healthy, lots of vegetables.", "Doing more chores around the house could also be a generous way of showing support, I do as much as I can at home to help my mom's stress."]], ["What foods can a teenager cook for his parents to help their depression?", "JJCIHC", ["ripe fresh fruits.", "&amp;#x200B;  Especially citrus and blueberries, also young thai coconuts, and Bananas.", "&amp;#x200B;  Hit up the asian market near you."]], ["What foods can a teenager cook for his parents to help their depression?", "NoopeNotTaken_", ["Old nostalgic homemade recipes would be a good bet.", "any way of getting to know their old favorites?"]], ["What foods can a teenager cook for his parents to help their depression?", "NightsBane155", ["I got this answer from a friend, Spaghetti.", "They tell me spaghetti tastes 100x better when your sad.", "&amp;#x200B;  Haven't tested myself, but I trust them  &amp;#x200B;  Also they're probably reading this aswell, so uhh.", ".", "."]], ["What foods can a teenager cook for his parents to help their depression?", "Ustinklikegg", ["Anything with potassium.", "black beans are a great source of it (bananas really dont have THAT much) a B12 supplement and a multivitamin.", "Food wont solve depression but having the building blocks and the energy to work on yourself will go a long way.", "Plus the daily morning activity of taking your vitamins can be a tool to put yourself in a self care mindset."]], ["What foods can a teenager cook for his parents to help their depression?", "DemocraticRepublic", ["The \"happy hormone\" is most commonly found in chocolate and bananas.", "So chocolate &amp; banana crepes would be amazing."]], ["What foods can a teenager cook for his parents to help their depression?", "DrBaggySmacker", ["Lasagne.", "It's an actual science fact that no one can remain sad while eating lasagne."]], ["What foods can a teenager cook for his parents to help their depression?", "SyrahSmile", ["Do you have a crock pot?", "Slow cooker recipes are really easy to make, and they can eat as much or little as they want.", "Some of my favorites are chicken tacos, chicken and biscuits, and chicken tortilla soup.", "Recipe links:  https://www.", "allrecipes.com/recipe/89539/slow-cooker-chicken-tortilla-soup/  https://www.", "allrecipes.com/recipe/8941/slow-cooker-chicken-and-dumplings/  Chicken tacos are very simple.", "Buy your favorite salsa (mine is Newman's Own medium, for this particular recipe).", "Add salsa, taco seasoning (packet or make your own), chopped cilantro, and 1 lb boneles, skinless chicken breast.", "If you want it spicy, add jalapenos and/or cayenne pepper.", "Cook on high for 4 hours.", "After 4 hours, shred the chicken (you can use 2 forks to do this) and mix it all together.", "Put it in taco shells with some cheese and avocado and it's delicious!"]], ["What foods can a teenager cook for his parents to help their depression?", "EsotericBlueberries", ["Stew and dumplings is a good option."]], ["What foods can a teenager cook for his parents to help their depression?", "mikeyapple", []], ["What foods can a teenager cook for his parents to help their depression?", "GoochThunder", ["If they ever told you about something their parents made for them.", "They would definitely appreciate you taking a stab at a family recipe."]], ["What foods can a teenager cook for his parents to help their depression?", "spot_o_tea", ["I’m gonna guess you’re not usually the one cooking?", "Honestly a nice slow cooker meal will help the house smell great!", "Also very easy prep if you’re unfamiliar with cooking.", "I’d suggest something like pot roast: get a cheap roast (chuck is always tasty), potatoes, carrots, beef broth and throw them in the slow cooker.", "Super easy!"]], ["What foods can a teenager cook for his parents to help their depression?", "Fiddlelydiddleydee", ["With love, it's not your job to care for your parents.", "Your job is to be a kid and have a childhood.", "Part of being a parent is taking good enough care of yourself so you can be an effective parent.", "Do you have enough support yourself?", "Do you have a family member/family friend/someone that is aware that you are parenting your parents?", "Source - am a mother myself and had a mother with more than a few mental health issues.", "Check out [https://www.", "reddit.com/r/MomForAMinute/](https://www.", "reddit.com/r/MomForAMinute/)  Here are some easy recipes for you to have a look at, to round them out chuck in a side of garlic bread and a bag of salad (Taylor Farms do excellent bags o' salad with the crunchy toppings and dressing so it's dead easy and there's zero chopping).", "These are in regular rotation at our house and are easy and inexpensive to make.", "1.", "One pot mac n cheese - [https://www.", "budgetbytes.com/miracle-mac-n-cheese/](https://www.", "budgetbytes.com/miracle-mac-n-cheese/) 2.", "Carrot and coriander soup    Take 500g of carrots and boil them.", "If you have a potato, you could chuck that in to boil as well.", "Fish the carrots out of the hot water and shove them in to the blender.", "Blitz until smooth, adding some of the water you used to boil the carrots if needed.", "Meanwhile, chop around 150g of cream cheese into cube and chuck in a mug.", "Add enough hot carrot cooking water to make the cheese soften and encourage this process with a fork.", "Chuck softened cheese and carrot water mixture in to blender and blitz.", "If you're feeling fancy chuck some garlic in to the mix.", "Chop up some fresh coriander and chuck in the blender and blitz - alternatively, a couple of pinches of dried coriander from a packet is grand.", "Optional - crispy bacon on top/ bacon sandwiches on the side.", "Nom nom nom.", "3.", "Fishcakes - you can sub out the maltzo meal for bog standard breadcrumbs and the salmon for tuna.", "They are a bit fiddly but yummy and they freeze well.", "[https://www.", "nigella.com/recipes/salmon-fishcakes](https://www.", "nigella.com/recipes/salmon-fishcakes) 4.", "Creamy mushroom herb pasta - this is delicious [https://www.", "budgetbytes.com/creamy-mushroom-herb-pasta/](https://www."]], ["What foods can a teenager cook for his parents to help their depression?", "momdotcom2019", ["This is my kiddo.", "I am a proud mamma.", "We have been under a lot of stress as a family and my husband's MS is a struggle as is my anxiety and hubby's disability and depression.", "Thank you all for the kind words and recipes.", "Even the apple egg :) love to all."]], ["What foods can a teenager cook for his parents to help their depression?", "Dudeyourcool", ["Depression is a hard thing.", "I have had it in the past and it can be a struggle just to get out of bed in the morning.", "The fact you want to help and be there is strong.", "It is not easy to help provide for people in the first place let alone the change in power dynamic that depression can cause.", "It isn’t what you make that matters.", "It is that you are willing to help them in anyway you can.", "Just be there to talk if they want to talk or just hang out with them and bull shit about the weather or about what the dog did today.", "Your presence matter that most.", "You being able to go I want to help you because I care about you THAT is what matters.", "Make them anything and sit down and eat it with them because being there matters more than anything else.", "It might be weird at first but as time goes on it will become easier.", "Showing someone with depression that you consistently care is one of the strongest things you can do to help with the maintenance of depression.", "Best of luck and you can do this!", "If this is about you and you need someone to talk to about this PM me!"]], ["What foods can a teenager cook for his parents to help their depression?", "outkast_co", ["Food can play a big part In depression.", "Focus on eating fatty fish, like salmon or albacore tuna, in place of red meat."]], ["What foods can a teenager cook for his parents to help their depression?", "commandrix", ["Something with amino acids, zinc, iron, and B vitamins that they like might help.", "Hidden nutrient deficiencies are often a contributing factor with depression."]], ["What foods can a teenager cook for his parents to help their depression?", "abunchofbunk", ["Make a salad.", "Lettuce and tomato.", "Grill up some chicken and chop it up.", "Avacado for sure.", "Cucumber and what ever dressing you all like.", "Salt and pepper to finish it off.", "Yum."]], ["What foods can a teenager cook for his parents to help their depression?", "rcher87", ["Edit: **tl;dr : make it all as colorful as possible!", "**  Fruit salad for breakfast, with yogurt and granola (I like grape nuts, personally, but whatever you/they like).", "Tea and lots of water.", "Maybe eggs if you’re feeling up to it.", "Lunch: sandwiches on wheat/multigrain bread - make sure to have veggies on there, lettuce and tomato for a traditional sandwich, but you can get creative here depending on your skill level, lots of water.", "Dinner: a salad kit with the dressing inside makes a pre-dinner salad easy.", "I like to make Rice a Roni and throw in some chopped up spinach and roasted red peppers with some Italian sausage, but you can put literally anything in there.", "Load up on the veggies and pick you favorite protein (chicken/ground beef/sausage).", "SO easy and takes me less than 20 mins to make.", "You got this.", "Keep it easy.", "For me and my depression, having a ritual (same breakfast every morning) was so helpful and became important, because it felt like I had something I could rely on.", "I hope this helps you - both these comments as well as the ability to do this, and the ritual of it.", "Just don’t put too much pressure on yourself.", "Keep it easy."]], ["What foods can a teenager cook for his parents to help their depression?", "Gracynvh", ["Bananas help me alot with depression.", "Try a banana/ peanut butter sandwich or  or banana/nutella sandwich.", "Something with iron is also a good idea."]], ["What foods can a teenager cook for his parents to help their depression?", "unsanctionedhero", ["Fish!", "!", "Especially salmon, as its really rich in omega-3."]], ["What foods can a teenager cook for his parents to help their depression?", "packpeach", ["What about breakfast for dinner?", "It's easy and everyone loves breakfast for dinner!"]], ["What foods can a teenager cook for his parents to help their depression?", "FurBurd", []], ["What foods can a teenager cook for his parents to help their depression?", "dieselengine9", ["I'm sorry for your situation.", "What a heartbreaking question."]], ["What foods can a teenager cook for his parents to help their depression?", "espada_laser", ["Greens, healthy fats and some lean meat.", "The link between gut flora and mental health is real."]], ["What foods can a teenager cook for his parents to help their depression?", "Sploitspiller", ["Whatever it is, keep it healthy.", "Depression can come from bad habits and a poor diet is one of those bad habits (along with lack of physical exercise, mental exercise, social exercise)."]], ["What foods can a teenager cook for his parents to help their depression?", "JayBerryLe", ["Spaghetti with Italian bread!"]], ["What foods can a teenager cook for his parents to help their depression?", "HeadedPumpkin", ["Bacon and eggs.", ".", ".", "delicious anytime."]], ["What foods can a teenager cook for his parents to help their depression?", "AgedAardvark", ["I hope you know that you can help them as much as you’re able and it still might not help.", "It’s right that you want to cook, but there may be nothing you can do to “fix” the problem.", "Do what you can, but don’t forget to take care of yourself, too.", "You’re likely at elevated risk of depression your self, so maybe see if there’s a professional you could check in with to talk things over."]], ["What foods can a teenager cook for his parents to help their depression?", "Trageduck", []], ["What foods can a teenager cook for his parents to help their depression?", "Ace-Anarchy", ["Dude I’ve been looking through your posts, Are you okay?"]], ["What foods can a teenager cook for his parents to help their depression?", "knownmagic", ["Fixing your parents is not and should not feel like your job.", "Are you able to get counseling of any kind?"]]]}
